Rainchus/marioparty4/src/REL/m409Dll/player.c
    temp_r30 = &arg0->unk3C[0];
    if (temp_r30->unk0.x < -600.0f) {
        temp_r30->unk0.x = -600.0f;
    }
    if (temp_r30->unk0.x > 600.0f) {
        temp_r30->unk0.x = 600.0f;
    }
    if (temp_r30->unk0.y < 350.0f) {
        temp_r30->unk0.y = 350.0f;
    }
    if (temp_r30->unk0.y > 1200.0f) {
        temp_r30->unk0.y = 1200.0f;
    }
    sp8 = 75.0f;
    spC = temp_r30->unk0;
    var_r26 = &spC;
    var_r28 = fn_1_A9C0(var_r26, &sp8);
    temp_r31 = &arg0->unk3C[1];
    if (var_r28 == -1) {
        if (temp_r31->unk70 != -1) {
            temp_r31->unk70 = -1;
            temp_r31->unk74f = 0.0f;
            temp_r31->unk58.x = temp_r31->unk0.x;
            temp_r31->unk58.y = temp_r31->unk0.y;
            temp_r31->unk58.z = temp_r31->unk0.z;
            temp_r31->unk78 = temp_r31->unk18;
        }
        if (temp_r31->unk74f < 90.0f) {
            temp_r31->unk74f += 9.0f;
            if (temp_r31->unk74f > 90.0f) {
                temp_r31->unk74f = 90.0f;
            }
            temp_f31 = sin((M_PI * temp_r31->unk74f) / 180.0);
            temp_f30 = cos((M_PI * temp_r31->unk74f) / 180.0);
            sp18.x = temp_r30->unk0.x - temp_r31->unk58.x;
            sp18.y = temp_r30->unk0.y - temp_r31->unk58.y;
            sp18.z = temp_r30->unk0.z - temp_r31->unk58.z;
            temp_r31->unk0.x = (temp_r31->unk58.x + (sp18.x * temp_f31));
            temp_r31->unk0.y = (temp_r31->unk58.y + (sp18.y * temp_f31));
            temp_r31->unk0.z = (temp_r31->unk58.z + (sp18.z * temp_f31));
            temp_r31->unk18 = (0.001f + (temp_r31->unk78 * temp_f30));
            temp_r31->unk1C = (0.001f + (temp_r31->unk78 * temp_f30));
            temp_r31->unk20 = 1.0f;
            return;
        }
        temp_r31->unk34 |= 4;
        temp_r31->unk0.x = temp_r30->unk0.x;
        temp_r31->unk0.y = temp_r30->unk0.y;
        temp_r31->unk0.z = temp_r30->unk0.z;
        return;
    }
    temp_r29 = &lbl_1_bss_10C[var_r28];
    if (temp_r31->unk70 != var_r28) {
        temp_r31->unk70 = var_r28;
        temp_r31->unk74f = 0.0f;
        temp_r31->unk58.x = temp_r31->unk0.x;
        temp_r31->unk58.y = temp_r31->unk0.y;
        temp_r31->unk58.z = temp_r31->unk0.z;
        temp_r31->unk78 = temp_r31->unk18;
        temp_r31->unk7C = (2.5f - temp_r31->unk18);
    }
    if (temp_r31->unk74f < 90.0f) {
        temp_r31->unk74f += 9.0f;
        if (temp_r31->unk74f > 90.0f) {
            temp_r31->unk74f = 90.0f;
        }
        temp_f31 = sin((M_PI * temp_r31->unk74f) / 180.0);
        sp18.x = temp_r29->unkC.x - temp_r31->unk58.x;
        sp18.y = temp_r29->unkC.y - temp_r31->unk58.y;
        sp18.z = temp_r29->unkC.z - temp_r31->unk58.z;
        temp_r31->unk0.x = (temp_r31->unk58.x + (sp18.x * temp_f31));
        temp_r31->unk0.y = (temp_r31->unk58.y + (sp18.y * temp_f31));
        temp_r31->unk0.z = (temp_r31->unk58.z + (sp18.z * temp_f31));
        temp_r31->unk18 = (temp_r31->unk78 + (temp_r31->unk7C * temp_f31));
        temp_r31->unk1C = (temp_r31->unk78 + (temp_r31->unk7C * temp_f31));
        temp_r31->unk20 = 1.0f;
    } else {
        temp_r31->unk0.x = temp_r29->unkC.x;
        temp_r31->unk0.y = temp_r29->unkC.y;
        temp_r31->unk0.z = temp_r29->unkC.z;
    }
    temp_r31->unk34 &= ~4;
}

s8 fn_1_8D08(u8 arg0) {
    unkStruct7* data;
    unkStruct8Sub* var_r30;

    data = (unkStruct7*)lbl_1_bss_3A0[arg0]->data;
    var_r30 = fn_1_CCCC(data->unk57, 1);
    return var_r30->unk70;
}

void fn_1_8D6C(unkStruct8* arg0) {
    Vec sp20;
    Vec sp14;
    Vec sp8;
    s32 temp_r28;
    s32 var_r27;
    f32 var_f31;
    unkStruct10* var_r29;
    unkStruct7* temp_r30;
    unkStruct8Sub* temp_r31;

    temp_r31 = &arg0->unk3C[0];
    if ((temp_r31->unk34 & 4) == 0) {
        temp_r28 = temp_r31->unk72;
        if (temp_r31->unk74 == 0) {
            if (temp_r28 == -1) {
                sp8.x = temp_r31->unk58.x - temp_r31->unk0.x;
                sp8.y = temp_r31->unk58.y - temp_r31->unk0.y;
                sp8.z = temp_r31->unk58.z - temp_r31->unk0.z;
                fn_1_B378(&sp8);
                temp_r31->unk64.x = sp8.x;
                temp_r31->unk64.y = sp8.y;
                temp_r31->unk64.z = sp8.z;
            }
            temp_r31->unk74 = 0x10;
        }
        if (temp_r31->unk76 == 0) {
            if (temp_r28 != -1) {
                var_r29 = &lbl_1_bss_10C[temp_r28];
                if ((var_r29->unk2 != 0) && (var_r29->unk2 <= 4U)) {
                    sp8.x = var_r29->unkC.x - temp_r31->unk0.x;
                    sp8.y = var_r29->unkC.y - temp_r31->unk0.y;
                    sp8.z = var_r29->unkC.z - temp_r31->unk0.z;
                    fn_1_B378(&sp8);
                    temp_r31->unk64.x = sp8.x;
                    temp_r31->unk64.y = sp8.y;
                    temp_r31->unk64.z = sp8.z;
                }
            }
            sp8.x = 100.0f * (2.0f * temp_r31->unk64.x);
            sp8.y = 100.0f * (2.0f * temp_r31->unk64.y);
            sp8.z = 100.0f * (2.0f * temp_r31->unk64.z);
            for (var_r29 = &lbl_1_bss_10C[0], var_r27 = 0; var_r27 < 8; var_r27++, var_r29++) {
                if ((Hu3DModelAttrGet(var_r29->unk0) & 1) == 0) {
                    var_f31 = fn_1_B6A4(&var_r29->unkC, temp_r31, &sp8);
                    if (!(var_f31 >= 2250.0f) && (var_r29->unk2 == 3)) {
                        var_r29->unk2 = 4;
                        temp_r31->unk34 |= 4;
                        temp_r30 = (unkStruct7*)lbl_1_bss_3A0[temp_r31->unk70]->data;
                        if (var_r29->unk48 == lbl_1_bss_106) {
                            espAttrSet(temp_r30->unk5A[temp_r30->unk59][0], 4);
                            espAttrReset(temp_r30->unk5A[temp_r30->unk59][1], 4);
                            HuAudFXPlay(9);
                            temp_r30->unk59++;
                            omVibrate(temp_r30->unk0, 0xC, 6, 6);
                            if (temp_r30->unk59 < 3U) {
                                temp_r30->unk60++;
                            }
                        } else if (temp_r30->unk59 != 0) {
                            espAttrReset(temp_r30->unk5A[temp_r30->unk59][0], 4);
                            espAttrSet(temp_r30->unk5A[temp_r30->unk59][1], 4);
                        }
                    }
                }
            }
            sp20.x = -290.0f;
            sp20.y = 350.0f;
            sp20.z = -1200.0f;
            var_f31 = fn_1_B9E0(&sp20, temp_r31, &sp8, &sp14, &sp8);
            if (var_f31 <= 100.0f) {
                temp_r31->unk0.x = sp14.x;
                temp_r31->unk0.y = sp14.y;
                temp_r31->unk0.z = sp14.z;
                temp_r31->unk64.x = sp8.x;
                temp_r31->unk64.y = sp8.y;
                temp_r31->unk64.z = sp8.z;
                temp_r31->unk76 = 1;
                return;
            }
        }
        temp_r31->unk0.x = (temp_r31->unk0.x + (200.0f * temp_r31->unk64.x));
        temp_r31->unk0.y = (temp_r31->unk0.y + (200.0f * temp_r31->unk64.y));
        temp_r31->unk0.z = (temp_r31->unk0.z + (200.0f * temp_r31->unk64.z));
        if (--temp_r31->unk74 == 0) {
            temp_r31->unk34 |= 4;
        }
    }
}

