Rainchus/marioparty4/src/REL/m409Dll/player.c
void fn_1_91C0(omObjData* arg0) {
    s32 var_r28;
    s32 var_r30;
    unkStruct10* var_r31;

    lbl_1_bss_108 = 0;
    var_r28 = Hu3DModelCreateFile(0x20000);
    arg0->model[0] = var_r28;
    Hu3DModelAttrSet(var_r28, 0x40000001);

    for (var_r30 = 0; var_r30 < 3; var_r30++) {
        arg0->motion[var_r30] = Hu3DJointMotion(var_r28, HuDataSelHeapReadNum(var_r30 + 0x28000F, 0x10000000, HEAP_DATA));
    }
    Hu3DMotionSet(var_r28, arg0->motion[0]);
    omSetTra(arg0, 419.99997f, 250.0f, -180.0f);
    omSetRot(arg0, 0.0f, -30.0f, 0.0f);
    
    for (var_r30 = 0; var_r30 < 4; var_r30++) {
        arg0->work[var_r30] = 0;
    }
    
    for (var_r30 = 0; var_r30 < 8; var_r30++) {
        var_r28 = Hu3DModelCreateFile(var_r30 + 0x28001B);
        arg0->model[var_r30 + 1] = var_r28;
        Hu3DModelAttrSet(var_r28, 1);
    }
    lbl_1_bss_104 = 0;
    
    
    for (var_r31 = lbl_1_bss_10C, var_r30 = 0; var_r30 < 8; var_r30++, var_r31++) {
        var_r28 = Hu3DModelCreateFile(var_r30 + 0x280013);
        var_r31->unk0 = var_r28;
        Hu3DModelLayerSet(var_r28, 3);
        var_r31->unkC.x = -400.0f + (100.0f * var_r30);
        var_r31->unkC.y = 300.0f + (100.0f * var_r30);
        var_r31->unkC.z = -1200.0f;
        Hu3DModelPosSet(var_r28, var_r31->unkC.x, var_r31->unkC.y, var_r31->unkC.z);
        var_r31->unk2 = var_r31->unk3 = 0;
        var_r31->unk18.x = var_r31->unk18.y = var_r31->unk18.z = 0.0f;
        var_r31->unk24.x = var_r31->unk24.y = var_r31->unk24.z = 1.0f;
        var_r31->unk3C.x = var_r31->unk3C.y = var_r31->unk3C.z = 0.0f;
        var_r31->unk30.x = var_r31->unkC.x;
        var_r31->unk30.y = var_r31->unkC.y;
        var_r31->unk30.z = var_r31->unkC.z;
        var_r31->unk48 = var_r30;
        fn_1_DEF4((var_r31->unk1 = fn_1_DA48(1, 1)), 0, 0);
        fn_1_E2A8(lbl_1_bss_F0.unk6, 0, var_r30 + 0x280023, 0x40, 0x40);
        fn_1_EC1C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 2.0f, 2.0f, 1.0f);
        fn_1_F024(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 0xFF, 0xFF, 0xFF, 0xA0);
        fn_1_ED44(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, 0x40000004);
        fn_1_F17C(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, lbl_1_bss_F0.unkA, 0x11);
        fn_1_F2F8(lbl_1_bss_F0.unk6, lbl_1_bss_F0.unk8, lbl_1_bss_F0.unkA, 1.0f);
    }
    arg0->func = fn_1_962C;
}